Merge branch 'master' into gleocadie/make-sure-loader-works-with-3rd-party-dispatcher
